{
  "roasts": [
    "Your ex was like a software bug—unfixable and always crashing your mood.",
    "They had the emotional depth of a kiddie pool.",
    "Their biggest achievement was ghosting you faster than your internet connection.",
    "They treated you like Wi-Fi—only came close when they needed something.",
    "Breaking up with them was like uninstalling bloatware—your system is so much faster now.",
    "They thought they were the main character, but they were just an extra in your story.",
    "Your ex had two moods: unavailable and more unavailable.",
    "They brought nothing to the table except drama, and even that was low-budget.",
    "They thought gym selfies were a substitute for personality. Spoiler: they’re not.",
    "Their apologies were like software updates—too late and full of bugs.",
    "If overthinking was a job, they’d still find a way to get fired.",
    "Their loyalty was like public Wi-Fi—unreliable and insecure.",
    "They spent more time with their phone than with you. Too bad the phone didn’t dump them first.",
    "Their sense of humor was so bad it made dad jokes look funny.",
    "They thought ghosting was a personality trait.",
    "They were like an expired coupon—no value and always disappointing.",
    "They treated communication like a diet—they kept skipping it.",
    "They were about as consistent as a vending machine that only takes old coins.",
    "They had all the red flags but none of the carnival fun.",
    "Your ex was a social media influencer… in their own head.",
    "Their best trait was their ability to ruin everything.",
    "They were the plot twist no one asked for or wanted.",
    "They spent more time playing games than building a future with you.",
    "They were the human equivalent of an unreadable CAPTCHA.",
    "Their commitment lasted about as long as a Snapchat streak.",
    "They acted like a boss level but were just a tutorial villain.",
    "They treated every argument like a competition—too bad they only ever won at being wrong.",
    "They were like a broken clock—wrong 24/7.",
    "Their biggest flex was surviving without self-awareness.",
    "They treated your emotions like a Netflix trial—canceled after the free month.",
    "Their promises were like beta features—always under development and never delivered.",
    "They ghosted you but forgot they weren't that hard to forget.",
    "Their ego was so big, it needed its own zip code.",
    "They were like a low-budget horror movie—predictable and not even scary.",
    "They thought being mysterious meant never texting back.",
    "They treated your kindness like it was an ATM—always withdrawing, never depositing.",
    "Your ex was like a tutorial you couldn’t skip but learned nothing from.",
    "They thought ignoring you was an Olympic sport, but they didn’t even medal.",
    "They acted like they were the prize when they were the participation trophy.",
    "Their time management was so bad, even their lies didn’t show up on time.",
    "They thought gaslighting was a love language.",
    "They had a talent for making you feel alone, even in a room full of people.",
    "They were the red flag you ignored because you thought you could turn it green.",
    "They treated emotional availability like it was out of stock.",
    "They had the charm of a spam email and the reliability of a pop-up ad.",
    "They thought silence was a solution. It wasn’t.",
    "They spent more time rewatching TV shows than understanding you.",
    "Your breakup glow-up is their biggest regret.",
    "They were like a free trial that expired way too fast."
  ]
}
